## Northwind Database

### Import necessary libraries

In [1]:
import pandas as pd

### Import the data sets

In [5]:
shippers = pd.read_excel('Northwind Data/shippers.xlsx')
employees = pd.read_excel('Northwind Data/employees.xlsx')
orders = pd.read_excel('Northwind Data/orders.xlsx')
customers = pd.read_excel('Northwind Data/customers.xlsx')
products = pd.read_excel('Northwind Data/products.xlsx')
order_details = pd.read_excel('Northwind Data/order_details.xlsx')
categories = pd.read_excel('Northwind Data/categories.xlsx')
regions = pd.read_excel('Northwind Data/regions.xlsx')
suppliers = pd.read_excel('Northwind Data/supliers.xlsx')
territories = pd.read_excel('Northwind Data/territories.xlsx')
employee_territories = pd.read_excel('Northwind Data/employee_territories.xlsx')

### Exploratory Data Analysis

In [7]:
shippers

   ShipperID       CompanyName           Phone
0          1    Speedy Express  (503) 555-9831
1          2    United Package  (503) 555-3199
2          3  Federal Shipping  (503) 555-9931

In [8]:
shippers.dtypes

ShipperID       int64
CompanyName    object
Phone          object
dtype: object

In [11]:
employees.head()

,EmployeeID,LastName,FirstName,Title,TitleOfCourtesy,BirthDate,HireDate,Address,City,Region,PostalCode,Country,HomePhone,Extension,Notes,ReportsTo,PhotoPath,Salary
0,1,Davolio,Nancy,Sales Representative,Ms.,1948-12-08,1992-05-01,507 - 20th Ave. E.Apt. 2A,Seattle,WA,98122,USA,(206) 555-9857,5467,Education includes a BA in psychology from Col...,2.0,http://accweb/emmployees/davolio.bmp,2954.55
1,2,Fuller,Andrew,"Vice President, Sales",Dr.,1952-02-19,1992-08-14,908 W. Capital Way,Tacoma,WA,98401,USA,(206) 555-9482,3457,Andrew received his BTS commercial in 1974 and...,NaN,http://accweb/emmployees/fuller.bmp,2254.49
2,3,Leverling,Janet,Sales Representative,Ms.,1963-08-30,1992-04-01,722 Moss Bay Blvd.,Kirkland,WA,98033,USA,(206) 555-3412,3355,Janet has a BS degree in chemistry from Boston...,2.0,http://accweb/emmployees/leverling.bmp,3119.15
3,4,Peacock,Margaret,Sales Representative,Mrs.,1937-09-19,1993-05-03,4110 Old Redmond Rd.,Redmond,WA,98052,USA,(206) 555-8122,5176,Margaret holds a BA in English literature from...,2.0,http://accweb/emmployees/peacock.bmp,1861.08
4,5,Buchanan,Steven,Sales Manager,Mr.,1955-03-04,1993-10-17,14 Garrett Hill,London,NaN,SW1 8JR,UK,(71) 555-4848,3453,Steven Buchanan graduated from St. Andrews Uni...,2.0,http://accweb/emmployees/buchanan.bmp,1744.21

In [12]:
employees.isna().sum()

EmployeeID         0
LastName           0
FirstName          0
Title              0
TitleOfCourtesy    0
BirthDate          0
HireDate           0
Address            0
City               0
Region             4
PostalCode         0
Country            0
HomePhone          0
Extension          0
Notes              0
ReportsTo          1
PhotoPath          0
Salary             0
dtype: int64

In [13]:
employees.dtypes

EmployeeID                  int64
LastName                   object
FirstName                  object
Title                      object
TitleOfCourtesy            object
BirthDate          datetime64[ns]
HireDate           datetime64[ns]
Address                    object
City                       object
Region                     object
PostalCode                 object
Country                    object
HomePhone                  object
Extension                   int64
Notes                      object
ReportsTo                 float64
PhotoPath                  object
Salary                    float64
dtype: object

In [15]:
orders.head()

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight_Cost,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,NaN,44087,Germany
1,10260,OTTIK,4,1996-07-19,1996-08-16,1996-07-29,1,55.09,Ottilies Käseladen,Mehrheimerstr. 369,Köln,NaN,50739,Germany
2,10267,FRANK,4,1996-07-29,1996-08-26,1996-08-06,1,208.58,Frankenversand,Berliner Platz 43,München,NaN,80805,Germany
3,10273,QUICK,3,1996-08-05,1996-09-02,1996-08-12,3,76.07,QUICK-Stop,Taucherstraße 10,Cunewalde,NaN,01307,Germany
4,10277,MORGK,2,1996-08-09,1996-09-06,1996-08-13,3,125.77,Morgenstern Gesundkost,Heerstr. 22,Leipzig,NaN,04179,Germany

In [16]:
orders.isna().sum()

OrderID             0
CustomerID          0
EmployeeID          0
OrderDate           0
RequiredDate        0
ShippedDate        21
ShipVia             0
Freight_Cost        0
ShipName            0
ShipAddress         0
ShipCity            0
ShipRegion        507
ShipPostalCode     19
ShipCountry         0
dtype: int64

In [18]:
orders.dtypes

OrderID                    int64
CustomerID                object
EmployeeID                 int64
OrderDate         datetime64[ns]
RequiredDate      datetime64[ns]
ShippedDate       datetime64[ns]
ShipVia                    int64
Freight_Cost             float64
ShipName                  object
ShipAddress               object
ShipCity                  object
ShipRegion                object
ShipPostalCode            object
ShipCountry               object
dtype: object

In [20]:
customers.head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,NaN,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,NaN,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,NaN,05023,Mexico,(5) 555-3932,NaN
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,NaN,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,NaN,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

In [21]:
customers.isna().sum()

CustomerID       0
CompanyName      0
ContactName      0
ContactTitle     0
Address          0
City             0
Region          60
PostalCode       1
Country          0
Phone            0
Fax             22
dtype: int64

In [22]:
customers.dtypes

CustomerID      object
CompanyName     object
ContactName     object
ContactTitle    object
Address         object
City            object
Region          object
PostalCode      object
Country         object
Phone           object
Fax             object
dtype: object

In [24]:
products.head()

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18.00,39,0,10,False
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,False
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00,13,70,25,False
3,4,Chef Anton's Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,False
4,5,Chef Anton's Gumbo Mix,2,2,36 boxes,21.35,0,0,0,True

In [25]:
products.isna().sum()

ProductID          0
ProductName        0
SupplierID         0
CategoryID         0
QuantityPerUnit    0
UnitPrice          0
UnitsInStock       0
UnitsOnOrder       0
ReorderLevel       0
Discontinued       0
dtype: int64

In [26]:
products.dtypes

ProductID            int64
ProductName         object
SupplierID           int64
CategoryID           int64
QuantityPerUnit     object
UnitPrice          float64
UnitsInStock         int64
UnitsOnOrder         int64
ReorderLevel         int64
Discontinued          bool
dtype: object

In [28]:
order_details.head()

   OrderID  ProductID  UnitPrice  Quantity  Discount
0    10508         39       18.0        10       0.0
1    10521         35       18.0         3       0.0
2    10530         76       18.0        50       0.0
3    10546         35       18.0        30       0.0
4    10553         35       18.0         6       0.0

In [29]:
order_details.isna().sum()

OrderID      0
ProductID    0
UnitPrice    0
Quantity     0
Discount     0
dtype: int64

In [30]:
order_details.dtypes

OrderID        int64
ProductID      int64
UnitPrice    float64
Quantity       int64
Discount     float64
dtype: object

In [31]:
categories.head()

,CategoryID,CategoryName,Description,picture
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",0x151C2F00020000000D000E0014002100FFFFFFFF4269...
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an...",0x151C2F00020000000D000E0014002100FFFFFFFF4269...
2,3,Confections,"Desserts, candies, and sweet breads",0x151C2F00020000000D000E0014002100FFFFFFFF4269...
3,4,Dairy Products,Cheeses,0x151C2F00020000000D000E0014002100FFFFFFFF4269...
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal",0x151C2F00020000000D000E0014002100FFFFFFFF4269...

In [32]:
categories.isna().sum()

CategoryID      0
CategoryName    0
Description     0
picture         0
dtype: int64

In [33]:
categories.dtypes

CategoryID       int64
CategoryName    object
Description     object
picture         object
dtype: object

In [34]:
regions.head()

   RegionID RegionDescription
0         1           Eastern
1         2           Western
2         3          Northern
3         4          Southern

In [35]:
regions.isna().sum()

RegionID             0
RegionDescription    0
dtype: int64

In [36]:
regions.dtypes

RegionID              int64
RegionDescription    object
dtype: object

In [37]:
suppliers.head()

,SupplierID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax,HomePage
0,1,Exotic Liquids,Charlotte Cooper,Purchasing Manager,49 Gilbert St.,London,NaN,EC1 4SD,UK,(171) 555-2222,NaN,NaN
1,2,New Orleans Cajun Delights,Shelley Burke,Order Administrator,P.O. Box 78934,New Orleans,LA,70117,USA,(100) 555-4822,NaN,#CAJUN.HTM#
2,3,Grandma Kelly's Homestead,Regina Murphy,Sales Representative,707 Oxford Rd.,Ann Arbor,MI,48104,USA,(313) 555-5735,(313) 555-3349,NaN
3,4,Tokyo Traders,Yoshi Nagase,Marketing Manager,9-8 Sekimai Musashino-shi,Tokyo,NaN,100,Japan,(03) 3555-5011,NaN,NaN
4,5,Cooperativa de Quesos 'Las Cabras',Antonio del Valle Saavedra,Export Administrator,Calle del Rosal 4,Oviedo,Asturias,33007,Spain,(98) 598 76 54,NaN,NaN

In [38]:
suppliers.isna().sum()

SupplierID       0
CompanyName      0
ContactName      0
ContactTitle     0
Address          0
City             0
Region          20
PostalCode       0
Country          0
Phone            0
Fax             16
HomePage        24
dtype: int64

In [39]:
suppliers.dtypes

SupplierID       int64
CompanyName     object
ContactName     object
ContactTitle    object
Address         object
City            object
Region          object
PostalCode      object
Country         object
Phone           object
Fax             object
HomePage        object
dtype: object

In [40]:
territories.head()

   TerritoryID TerritoryDescription  RegionID
0         1581             Westboro         1
1         1730              Bedford         1
2         1833            Georgetow         1
3         2116               Boston         1
4         2139            Cambridge         1

In [41]:
territories.isna().sum()

TerritoryID             0
TerritoryDescription    0
RegionID                0
dtype: int64

In [42]:
territories.dtypes

TerritoryID              int64
TerritoryDescription    object
RegionID                 int64
dtype: object

In [44]:
employee_territories.head()

   EmployeeID  TerritoryID
0           1         6897
1           1        19713
2           2         1581
3           2         1730
4           2         1833

In [45]:
employee_territories.isna().sum()

EmployeeID     0
TerritoryID    0
dtype: int64

In [46]:
employee_territories.dtypes

EmployeeID     int64
TerritoryID    int64
dtype: object

### 1. What is the overall top ‘N’ selling food categories? The output must show the category name and the count of sales done by each category.